---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveLevel
source: html/69166a15-b406-1989-d241-ec6156c74106.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveLevel Property

"Level"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveLevel { get; }
```